10-rails/app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "My first micro post.\r\n"], ["created_at", Tue, 12 Nov 2013 19:15:53 UTC +00:00], ["updated_at", Tue, 12 Nov 2013 19:15:53 UTC +00:00], ["user_id", 1]]
---
	def create
		@micropost = current_user.microposts.build(params[:micropost])
		if @micropost.save

DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 315]]
---
	def destroy
		@micropost.destroy