10-rails/app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
SELECT COUNT(*) FROM "users"

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    # @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "password_digest" = '$2a$10$3C304qHenArJH0RrcokOd.dgmbolvZS5kmRMOu6UUlHwD4Y228vRu', "remember_token" = 'N49HA-QiEtabD9I6OEE7JQ', "updated_at" = '2013-11-07 20:53:59.219773' WHERE "users"."id" = 6

  def following
    @title = "Following"
    @user = User.find(params[:id])
    @users = @user.followed_users.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "users"

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
    @users = @user.followers.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "users"